WilliamGFish/sdk-nrf/lib/dect_nr_plus/src/dect_phy_nrf9161.c
/*
 * Copyright (c) 2025 - Manulyitca Ltd (William Fish)
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <string.h>
#include <zephyr.h>
#include <device.h>
#include <drivers/modem/nrf9160_modem.h> // Conceptual include for nRF9161 modem API
#include <net/net_buf.h>

#include <dect_nr_plus/dect_errors.h>
#include <dect_nr_plus/dect_types.h>
#include <dect_nr_plus/dect_phy_nrf9161.h> /* Own header */
#include <dect_nr_plus/dect_stats.h> // For updating statistics
#include <nrf_modem_dect_phy.h> // For direct Nordic PHY API calls

#include <logging/log.h>
LOG_MODULE_REGISTER(dect_phy_nrf9161, CONFIG_DECT_NR_PLUS_LOG_LEVEL);

/* Internal PHY context */
static struct {
	nrf9161_dect_phy_rx_callback_t rx_cb;
	nrf9161_dect_phy_tx_done_callback_t tx_done_cb;
	// No longer explicit resource_grant_cb with new direct scheduling
	uint32_t tx_power_dbm; /**< Current TX power in dBm. */
	uint8_t current_channel; /**< Currently active channel ID. */
	power_mode_t current_radio_mode; /**< Current PHY radio mode. */
	uint64_t current_modem_time; /**< Last known modem time in modem units. */
	K_MUTEX_DEFINE(mutex); /**< Mutex to protect context access. */
} phy_ctx;

/* Static forward declarations */
static void nrf9161_dect_phy_event_handler(nrf_modem_dect_phy_event_id_t id,
										   const nrf_modem_dect_phy_event_data_t *event_data);

dect_status_t nrf9161_dect_phy_init(const struct device *dev,
									nrf9161_dect_phy_rx_callback_t rx_cb,
									nrf9161_dect_phy_tx_done_callback_t tx_done_cb)
{
	LOG_INF("PHY: Initializing nRF9161 DECT PHY module...");
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	phy_ctx.rx_cb = rx_cb;
	phy_ctx.tx_done_cb = tx_done_cb;
	phy_ctx.tx_power_dbm = NRF_MODEM_DECT_PHY_TX_POWER_DEFAULT;
	phy_ctx.current_channel = 0; // Default channel
	phy_ctx.current_radio_mode = POWER_MODE_ACTIVE; // Start in active mode
	phy_ctx.current_modem_time = k_uptime_get() * NRF_MODEM_DECT_PHY_MODEM_UNIT_PER_MS; // Initialize with system uptime

	// Register the event handler for all PHY events
	int ret = nrf_modem_dect_phy_event_handler_set(nrf9161_dect_phy_event_handler);
	if (ret != 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_PHY_NOT_READY, "PHY: Failed to set event handler: %d.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_PHY_NOT_READY;
	}

	// Activate the DECT PHY stack
	ret = nrf_modem_dect_phy_activate();
	if (ret != 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_PHY_NOT_READY, "PHY: Failed to activate DECT PHY: %d.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_PHY_NOT_READY;
	}
	LOG_INF("PHY: DECT PHY activated.");

	// Configure initial PHY parameters (e.g., radio mode, TX power, LBT parameters)
	nrf_modem_dect_phy_config_t config = {
		.radio_mode = NRF_MODEM_DECT_PHY_RADIO_MODE_LOW_LATENCY, // Initial active mode
		.tx_power = NRF_MODEM_DECT_PHY_TX_POWER_DEFAULT,
		.lbt = {
			.enabled = dect_config.enable_lbt,
			.rssi_threshold = dect_config.lbt_rssi_threshold_dbm,
			.period = dect_config.lbt_period_modem_units,
		},
	};

	ret = nrf_modem_dect_phy_configure(&config);
	if (ret != 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_PHY_NOT_READY, "PHY: Failed to configure DECT PHY: %d.", ret);
		nrf_modem_dect_phy_deactivate(); // Deactivate if configure fails
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_PHY_NOT_READY;
	}
	LOG_INF("PHY: DECT PHY configured with initial radio mode %u, TX power %d, LBT %s.",
			config.radio_mode, config.tx_power, config.lbt.enabled ? "enabled" : "disabled");

	LOG_INF("PHY: nRF9161 DECT PHY module initialized successfully.");
	k_mutex_unlock(&phy_ctx.mutex);
	return DECT_STATUS_OK;
}

dect_status_t nrf9161_dect_phy_transmit(const struct device *dev, struct net_buf *data_buf,
										uint32_t harq_transaction_id,
										nrf_modem_dect_phy_tx_type_t tx_type,
										uint64_t start_time_modem_units)
{
	ARG_UNUSED(dev);
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	if (!data_buf || data_buf->len == 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_INVALID_PARAM, "PHY: Cannot transmit NULL or empty data_buf.");
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_INVALID_PARAM;
	}

	if (data_buf->len > NRF_MODEM_DECT_PHY_MAX_PAYLOAD_SIZE) {
		DECT_ERROR_HANDLER(DECT_ERROR_PDU_TOO_LARGE, "PHY: PDU size %u exceeds max PHY payload %u.",
						   data_buf->len, NRF_MODEM_DECT_PHY_MAX_PAYLOAD_SIZE);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_PDU_TOO_LARGE;
	}

	// Prepare TX parameters
	nrf_modem_dect_phy_tx_params_t tx_params = {
		.tx_type = tx_type,
		.tx_power = phy_ctx.tx_power_dbm,
		.start_time = start_time_modem_units,
		.channel = phy_ctx.current_channel,
		.payload_len = data_buf->len,
		.payload = data_buf->data,
	};

	LOG_DBG("PHY: Calling nrf_modem_dect_phy_tx(HARQ ID 0x%x, channel %u, start_time %llu, len %u, type %u).",
			harq_transaction_id, phy_ctx.current_channel, start_time_modem_units,
			tx_params.payload_len, tx_params.tx_type);

	// The `harq_transaction_id` is passed as the `handle` for the Nordic API call.
	int ret = nrf_modem_dect_phy_tx(harq_transaction_id, &tx_params);

	if (ret != 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_PHY_TX_FAILED, "PHY: nrf_modem_dect_phy_tx failed: %d.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		switch (ret) {
			case -NRF_MODEM_DECT_PHY_ERR_LBT_BUSY: return DECT_ERROR_PHY_CHANNEL_BUSY;
			case -NRF_MODEM_DECT_PHY_ERR_SCHED_TOO_LATE: return DECT_ERROR_PHY_SCHED_TOO_LATE;
			case -NRF_MODEM_DECT_PHY_ERR_SCHED_CONFLICT: return DECT_ERROR_PHY_SCHED_CONFLICT;
			case -NRF_EPERM: return DECT_ERROR_PHY_NOT_READY;
			default: return DECT_ERROR_PHY_TX_FAILED;
		}
	}

	LOG_DBG("PHY: nrf_modem_dect_phy_tx request queued successfully for HARQ ID 0x%x.", harq_transaction_id);
	// Data buffer ownership is conceptually transferred to the modem.
	// The MAC layer will unref this buffer when it receives the TX completion notification.

	k_mutex_unlock(&phy_ctx.mutex);
	return DECT_STATUS_OK;
}

dect_status_t nrf9161_dect_phy_receive(const struct device *dev, uint64_t start_time_modem_units,
									   uint32_t duration_modem_units,
									   nrf_modem_dect_phy_rx_mode_t rx_mode)
{
	ARG_UNUSED(dev);
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	// Prepare RX parameters
	nrf_modem_dect_phy_rx_params_t rx_params = {
		.rx_mode = rx_mode,
		.start_time = start_time_modem_units,
		.duration = duration_modem_units,
		.channel = phy_ctx.current_channel,
	};

	LOG_DBG("PHY: Calling nrf_modem_dect_phy_rx(channel %u, start_time %llu, duration %u, mode %u).",
			phy_ctx.current_channel, start_time_modem_units, duration_modem_units, rx_mode);

	// The handle for RX operations can be 0 or a unique ID if we need to track multiple RX requests.
	// For simple continuous or single-shot RX, 0 is often sufficient.
	int ret = nrf_modem_dect_phy_rx(0, &rx_params);

	if (ret != 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_PHY_RX_FAILED, "PHY: nrf_modem_dect_phy_rx failed: %d.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		switch (ret) {
			case -NRF_EPERM: return DECT_ERROR_PHY_NOT_READY;
			case -NRF_EINVAL: return DECT_ERROR_INVALID_PARAM;
			default: return DECT_ERROR_PHY_RX_FAILED;
		}
	}
	LOG_DBG("PHY: nrf_modem_dect_phy_rx request queued successfully.");
	k_mutex_unlock(&phy_ctx.mutex);
	return DECT_STATUS_OK;
}

