WilliamGFish/sdk-nrf/lib/dect_nr_plus/src/dect_phy_nrf9161.c
dect_status_t nrf9161_dect_phy_transmit_receive(const struct device *dev,
											   struct net_buf *tx_data_buf,
											   uint32_t tx_harq_transaction_id,
											   nrf_modem_dect_phy_tx_type_t tx_type,
											   uint64_t tx_start_time_modem_units,
											   uint32_t rx_start_offset_modem_units,
											   uint32_t rx_duration_modem_units,
											   nrf_modem_dect_phy_rx_mode_t rx_mode)
{
	ARG_UNUSED(dev);
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	if (!tx_data_buf || net_buf_tailroom(tx_data_buf) == 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_INVALID_PARAM, "PHY: Cannot TX/RX NULL or empty tx_data_buf.");
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_INVALID_PARAM;
	}

	if (net_buf_tailroom(tx_data_buf) > NRF_MODEM_DECT_PHY_MAX_PAYLOAD_SIZE) {
		DECT_ERROR_HANDLER(DECT_ERROR_PDU_TOO_LARGE, "PHY: TX PDU size %u exceeds max PHY payload %u.",
						   net_buf_tailroom(tx_data_buf), NRF_MODEM_DECT_PHY_MAX_PAYLOAD_SIZE);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_PDU_TOO_LARGE;
	}

	nrf_modem_dect_phy_tx_rx_params_t tx_rx_params = {
		.tx.tx_type = tx_type,
		.tx.tx_power = phy_ctx.tx_power_dbm,
		.tx.channel = phy_ctx.current_channel,
		.tx.payload_len = net_buf_tailroom(tx_data_buf),
		.tx.payload = tx_data_buf->data,
		.rx.rx_mode = rx_mode,
		.rx.channel = phy_ctx.current_channel, // RX usually on same channel as TX
		.rx_start_offset = rx_start_offset_modem_units,
		.rx.duration = rx_duration_modem_units,
	};

	LOG_DBG("PHY: Calling nrf_modem_dect_phy_tx_rx(TX HARQ ID 0x%x, start_time %llu, RX offset %u, RX duration %u).",
			tx_harq_transaction_id, tx_start_time_modem_units, rx_start_offset_modem_units, rx_duration_modem_units);

	// The tx_harq_transaction_id is passed as the handle for the Nordic API call.
	int ret = nrf_modem_dect_phy_tx_rx(tx_harq_transaction_id, tx_start_time_modem_units, &tx_rx_params);

	if (ret != 0) {
		DECT_ERROR_HANDLER(DECT_ERROR_PHY_TX_FAILED, "PHY: nrf_modem_dect_phy_tx_rx failed: %d.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		// Map Nordic error codes as in nrf9161_dect_phy_transmit
		switch (ret) {
			case -NRF_MODEM_DECT_PHY_ERR_LBT_BUSY: return DECT_ERROR_PHY_CHANNEL_BUSY;
			case -NRF_MODEM_DECT_PHY_ERR_SCHED_TOO_LATE: return DECT_ERROR_PHY_SCHED_TOO_LATE;
			case -NRF_MODEM_DECT_PHY_ERR_SCHED_CONFLICT: return DECT_ERROR_PHY_SCHED_CONFLICT;
			case -NRF_EPERM: return DECT_ERROR_PHY_NOT_READY;
			default: return DECT_ERROR_PHY_TX_FAILED;
		}
	}

	LOG_DBG("PHY: nrf_modem_dect_phy_tx_rx request queued successfully for HARQ ID 0x%x.", tx_harq_transaction_id);
	// Data buffer ownership conceptually transferred to modem. MAC will handle its unref.

	k_mutex_unlock(&phy_ctx.mutex);
	return DECT_STATUS_OK;
}

dect_status_t nrf9161_dect_phy_set_channel(const struct device *dev, uint8_t channel_id)
{
	ARG_UNUSED(dev);
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	if (channel_id >= NRF_MODEM_DECT_PHY_NUM_CHANNELS) {
		DECT_ERROR_HANDLER(DECT_ERROR_INVALID_PARAM, "PHY: Invalid channel ID %u.", channel_id);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_INVALID_PARAM;
	}

	// The nrf_modem_dect_phy_configure function is used to set the current channel
	// However, it's typically part of a larger configuration update.
	// If only channel change is needed, we need to ensure the modem is in a state
	// where channel changes are allowed without disrupting ongoing operations.
	// For simplicity, we directly update the internal context. The next TX/RX will use it.
	// A real implementation might need to call nrf_modem_dect_phy_configure with updated channel.

	// For now, we update the internal context and rely on subsequent TX/RX calls.
	phy_ctx.current_channel = channel_id;
	LOG_DBG("PHY: Channel set to %u (internal context only).", phy_ctx.current_channel);

	// To make this effective immediately for the modem, we would need to reconfigure.
	// This might involve stopping ongoing TX/RX and restarting with new channel.
	// Example:
	nrf_modem_dect_phy_config_t current_config;
	int ret = nrf_modem_dect_phy_config_get(&current_config);
	if (ret == 0) {
		current_config.channel = channel_id;
		ret = nrf_modem_dect_phy_configure(&current_config);
		if (ret != 0) {
			DECT_ERROR_HANDLER(DECT_ERROR_PHY_CONFIG_FAILED, "PHY: Failed to configure channel %u: %d.", channel_id, ret);
			k_mutex_unlock(&phy_ctx.mutex);
			return DECT_ERROR_PHY_CONFIG_FAILED;
		}
		LOG_INF("PHY: Modem channel successfully set to %u.", channel_id);
	} else {
		DECT_ERROR_HANDLER(DECT_ERROR_GENERIC, "PHY: Failed to get current PHY config: %d. Channel not set in modem.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_GENERIC;
	}


	k_mutex_unlock(&phy_ctx.mutex);
	return DECT_STATUS_OK;
}

dect_status_t nrf9161_dect_phy_set_tx_power(const struct device *dev, int8_t power_dbm)
{
	ARG_UNUSED(dev);
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	// Check if power_dbm is within supported range (conceptual for now, or check Nordic API limits)
	if (power_dbm < NRF_MODEM_DECT_PHY_TX_POWER_MIN || power_dbm > NRF_MODEM_DECT_PHY_TX_POWER_MAX) {
		DECT_ERROR_HANDLER(DECT_ERROR_INVALID_PARAM, "PHY: TX power %d dBm out of range [%d, %d].",
						   power_dbm, NRF_MODEM_DECT_PHY_TX_POWER_MIN, NRF_MODEM_DECT_PHY_TX_POWER_MAX);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_INVALID_PARAM;
	}

	phy_ctx.tx_power_dbm = power_dbm;
	LOG_DBG("PHY: TX power set to %d dBm (internal context only).", phy_ctx.tx_power_dbm);

	// To apply to modem, retrieve current config, update tx_power, and re-configure
	nrf_modem_dect_phy_config_t current_config;
	int ret = nrf_modem_dect_phy_config_get(&current_config);
	if (ret == 0) {
		current_config.tx_power = power_dbm;
		ret = nrf_modem_dect_phy_configure(&current_config);
		if (ret != 0) {
			DECT_ERROR_HANDLER(DECT_ERROR_PHY_CONFIG_FAILED, "PHY: Failed to configure TX power %d: %d.", power_dbm, ret);
			k_mutex_unlock(&phy_ctx.mutex);
			return DECT_ERROR_PHY_CONFIG_FAILED;
		}
		LOG_INF("PHY: Modem TX power successfully set to %d dBm.", power_dbm);
	} else {
		DECT_ERROR_HANDLER(DECT_ERROR_GENERIC, "PHY: Failed to get current PHY config: %d. TX power not set in modem.", ret);
		k_mutex_unlock(&phy_ctx.mutex);
		return DECT_ERROR_GENERIC;
	}

	k_mutex_unlock(&phy_ctx.mutex);
	return DECT_STATUS_OK;
}

dect_status_t nrf9161_dect_phy_set_radio_mode(const struct device *dev, power_mode_t mode)
{
	ARG_UNUSED(dev);
	k_mutex_lock(&phy_ctx.mutex, K_FOREVER);

	nrf_modem_dect_phy_radio_mode_t modem_radio_mode;

